{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.17.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of129.bin", "group1-shard2of129.bin", "group1-shard3of129.bin", "group1-shard4of129.bin", "group1-shard5of129.bin", "group1-shard6of129.bin", "group1-shard7of129.bin", "group1-shard8of129.bin", "group1-shard9of129.bin", "group1-shard10of129.bin", "group1-shard11of129.bin", "group1-shard12of129.bin", "group1-shard13of129.bin", "group1-shard14of129.bin", "group1-shard15of129.bin", "group1-shard16of129.bin", "group1-shard17of129.bin", "group1-shard18of129.bin", "group1-shard19of129.bin", "group1-shard20of129.bin", "group1-shard21of129.bin", "group1-shard22of129.bin", "group1-shard23of129.bin", "group1-shard24of129.bin", "group1-shard25of129.bin", "group1-shard26of129.bin", "group1-shard27of129.bin", "group1-shard28of129.bin", "group1-shard29of129.bin", "group1-shard30of129.bin", "group1-shard31of129.bin", "group1-shard32of129.bin", "group1-shard33of129.bin", "group1-shard34of129.bin", "group1-shard35of129.bin", "group1-shard36of129.bin", "group1-shard37of129.bin", "group1-shard38of129.bin", "group1-shard39of129.bin", "group1-shard40of129.bin", "group1-shard41of129.bin", "group1-shard42of129.bin", "group1-shard43of129.bin", "group1-shard44of129.bin", "group1-shard45of129.bin", "group1-shard46of129.bin", "group1-shard47of129.bin", "group1-shard48of129.bin", "group1-shard49of129.bin", "group1-shard50of129.bin", "group1-shard51of129.bin", "group1-shard52of129.bin", "group1-shard53of129.bin", "group1-shard54of129.bin", "group1-shard55of129.bin", "group1-shard56of129.bin", "group1-shard57of129.bin", "group1-shard58of129.bin", "group1-shard59of129.bin", "group1-shard60of129.bin", "group1-shard61of129.bin", "group1-shard62of129.bin", "group1-shard63of129.bin", "group1-shard64of129.bin", "group1-shard65of129.bin", "group1-shard66of129.bin", "group1-shard67of129.bin", "group1-shard68of129.bin", "group1-shard69of129.bin", "group1-shard70of129.bin", "group1-shard71of129.bin", "group1-shard72of129.bin", "group1-shard73of129.bin", "group1-shard74of129.bin", "group1-shard75of129.bin", "group1-shard76of129.bin", "group1-shard77of129.bin", "group1-shard78of129.bin", "group1-shard79of129.bin", "group1-shard80of129.bin", "group1-shard81of129.bin", "group1-shard82of129.bin", "group1-shard83of129.bin", "group1-shard84of129.bin", "group1-shard85of129.bin", "group1-shard86of129.bin", "group1-shard87of129.bin", "group1-shard88of129.bin", "group1-shard89of129.bin", "group1-shard90of129.bin", "group1-shard91of129.bin", "group1-shard92of129.bin", "group1-shard93of129.bin", "group1-shard94of129.bin", "group1-shard95of129.bin", "group1-shard96of129.bin", "group1-shard97of129.bin", "group1-shard98of129.bin", "group1-shard99of129.bin", "group1-shard100of129.bin", "group1-shard101of129.bin", "group1-shard102of129.bin", "group1-shard103of129.bin", "group1-shard104of129.bin", "group1-shard105of129.bin", "group1-shard106of129.bin", "group1-shard107of129.bin", "group1-shard108of129.bin", "group1-shard109of129.bin", "group1-shard110of129.bin", "group1-shard111of129.bin", "group1-shard112of129.bin", "group1-shard113of129.bin", "group1-shard114of129.bin", "group1-shard115of129.bin", "group1-shard116of129.bin", "group1-shard117of129.bin", "group1-shard118of129.bin", "group1-shard119of129.bin", "group1-shard120of129.bin", "group1-shard121of129.bin", "group1-shard122of129.bin", "group1-shard123of129.bin", "group1-shard124of129.bin", "group1-shard125of129.bin", "group1-shard126of129.bin", "group1-shard127of129.bin", "group1-shard128of129.bin", "group1-shard129of129.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [25088, 4096], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [4096], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [4096], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [4096, 38], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [38], "dtype": "float32"}]}]}